tutorials/incompressible/icoDyMFoam/movingConeMotion/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    movingWall
    {
        type            wall;
        nFaces          27;
        startFace       374;
    }
    farFieldMoving
    {
        type            patch;
        nFaces          15;
        startFace       401;
    }
    fixedWall
    {
        type            wall;
        nFaces          12;
        startFace       416;
    }
    axis
    {
        type            empty;
        nFaces          0;
        startFace       428;
    }
    left
    {
        type            patch;
        nFaces          10;
        startFace       428;
    }
    farField
    {
        type            patch;
        nFaces          12;
        startFace       438;
    }
    back
    {
        type            wedge;
        nFaces          209;
        startFace       450;
    }
    front
    {
        type            wedge;
        nFaces          209;
        startFace       659;
    }
)

// ************************************************************************* //
