tutorials/incompressible/icoDyMFoam/movingConeMotion/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-02;
        relTol           0;
    };

    p
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-06;
        relTol           0.05;
    };

    pFinal
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-06;
        relTol           0;
    };

    U
    {
        solver           PBiCG;
        preconditioner   DILU;

        minIter          0;
        maxIter          1000;
        tolerance        1e-05;
        relTol           0;
    };
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
